`tf
Terraform will perform the following actions:
  # google_storage_bucket.main will be created
  + resource "google_storage_bucket" "main" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "dev-ss-444303_static_website_bucket"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
      + soft_delete_policy (known after apply)
      + versioning (known after apply)
      + website {
          + main_page_suffix = "index.html"
        }
    }
  # google_storage_bucket_object.main will be created
  + resource "google_storage_bucket_object" "main" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = "text/html"
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "index.html"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }
Plan: 2 to add, 0 to change, 0 to destroy.
`